#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/wiikip-org/go-container/runs/run-avdVhHb4YVUxqiFt

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...
kubernetes_namespace.go-container: Refreshing state... [id=go-container]
kubernetes_deployment.go-container-server: Refreshing state... [id=go-container/go-container-server]
kubernetes_service.go-container-service: Refreshing state... [id=go-container/go-container-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_deployment.go-container-server will be updated in-place
  ~ resource "kubernetes_deployment" "go-container-server" {
        id               = "go-container/go-container-server"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "wiikip/go-container:5affbec4f6b58685f395bbe355c0d3fd5ac916d2" -> "wiikip/go-container:3f515b0a57c9c9de7400a430011c8b8056e146e3"
                        name                       = "go-container"
                        # (8 unchanged attributes hidden)


                        # (2 unchanged blocks hidden)
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # kubernetes_role.go-container-role will be created
  + resource "kubernetes_role" "go-container-role" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "go-container-role"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "create",
              + "get",
              + "watch",
            ]
        }
    }

  # kubernetes_role_binding.go-container-rb will be created
  + resource "kubernetes_role_binding" "go-container-rb" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "go-container-rb"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "go-container-role"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "default"
          + namespace = "go-container"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>
*Pusher: @wiikip, Action: `pull_request`*